Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ПериодыДетализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПериодыДетализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолеЦветПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ПолеЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ОткрытьФорму("ОбщаяФорма.ИА_ВыборЦвета", Новый Структура("ИсходныйЦвет",ПолеЦвет),ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Шрифт     = Новый ХранилищеЗначения(ПолеШрифт);
	
	Если ЦветИзменен Тогда
		ТекущийОбъект.ЦветФона  = Новый ХранилищеЗначения(ПолеЦвет);
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
		ТекущийОбъект.Логотип = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных());
	КонецЕсли;
	
	ТекущийОбъект.Сотрудники.Очистить();
	Для каждого стр из ТЗ_Сотрудники Цикл
		Новстр = ТекущийОбъект.Сотрудники.Добавить();
		Новстр.ФизЛицо = стр.ФизЛицо;
	КонецЦикла;
	
	//Арчил Тваладзе 2016.04.26
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.ФизЛицо,
	               |	Сотрудники.НомерСтроки
	               |ПОМЕСТИТЬ втСотрудники
	               |ИЗ
	               |	&Сотрудники КАК Сотрудники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втСотрудники.ФизЛицо,
	               |	втСотрудники.НомерСтроки,
	               |	ИА_ДанныеФизЛиц.Пользователь
	               |ИЗ
	               |	втСотрудники КАК втСотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	               |		ПО втСотрудники.ФизЛицо = ИА_ДанныеФизЛиц.ФизЛицо
	               |ГДЕ
	               |	ИА_ДанныеФизЛиц.Пользователь ЕСТЬ NULL 
	               |	ИЛИ ИА_ДанныеФизЛиц.Пользователь = Значение(Справочник.Пользователи.ПустаяСсылка)";
				   
				   
	Запрос.УстановитьПараметр("Сотрудники", Объект.Сотрудники.Выгрузить());				  
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи   = Результат.Выбрать();
	
	//ТекстФизЛицо ="ФизЛицо";
	//Попытка
	//	ПустойПольз = Справочники.Пользователи.ПустаяСсылка();
	//	фл = ПустойПольз.ФизическоеЛицо;
	//	ТекстФизЛицо = "ФизическоеЛицо";
	//Исключение
	//Конецпопытки;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	Сотрудники.ФизЛицо,
	//|	Сотрудники.НомерСтроки
	//|ПОМЕСТИТЬ втСотрудники
	//|ИЗ
	//|	&Сотрудники КАК Сотрудники
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	втСотрудники.ФизЛицо,
	//|	втСотрудники.НомерСтроки
	//|ИЗ
	//|	втСотрудники КАК втСотрудники
	//|ГДЕ
	//|	НЕ втСотрудники.ФизЛицо В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					Пользователи.<ФизЛицо>
	//|				ИЗ
	//|					Справочник.Пользователи КАК Пользователи
	//|				ГДЕ
	//|					НЕ Пользователи.<ФизЛицо> ЕСТЬ NULL )";
	//
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "<ФизЛицо>", ТекстФизЛицо);
	//Запрос.УстановитьПараметр("Сотрудники", Объект.Сотрудники.Выгрузить());				  
	//Результат = Запрос.Выполнить();
	//Выборка   = Результат.Выбрать();
	//Конец Арчил Тваладзе
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Информация             = "В строке номер: "+ВыборкаДетальныеЗаписи.НомерСтроки+" отсутстует пользователь для физ. лица " + ВыборкаДетальныеЗаписи.ФизЛицо;
		
		Сообщение              = Новый СообщениеПользователю;
		//Сообщение.Поле         = "Сотрудники["+Строка(ВыборкаДетальныеЗаписи.НомерСтроки-1)+"].ФизЛицо";
		Сообщение.Текст        = НСтр("ru='"+Информация+"'");
		Сообщение.ПутьКДанным  = "Объект";
		Сообщение.Сообщить(); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Логотип");	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.Свойство("Родитель",Объект.Родитель);
		Параметры.Свойство("ТипТерминала",Объект.ТипТерминала);
	КонецЕсли;
	//
	Если Объект.Ссылка.Пустая() Тогда
		ПолеЦвет = Новый Цвет(255,255,255);
		ЦветИзменен = истина;
	Иначе
		Спр = РеквизитФормыВЗначение("Объект");
		ПолеЦвет  = Спр.ЦветФона.Получить();
		ПолеШрифт = Спр.Шрифт.Получить();
	КонецЕсли;
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Логотип");
	
	// 
	
	Для каждого стр из Объект.Сотрудники Цикл
		Новстр = ТЗ_Сотрудники.Добавить();
		Новстр.ФизЛицо = стр.ФизЛицо;
		
		детали = ЕстьФотоПользователь(стр.ФизЛицо);
		ЗаполнитьЗначенияСвойств(Новстр, детали);
	КонецЦикла;
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
	
	Если Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция") или Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел") тогда
		Элементы.НаименованиеДолжности.Видимость = Истина;
	Иначе
		Элементы.НаименованиеДолжности.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьФотоПользователь(ФизЛицо)
	Рез = Новый Структура("ЕстьПользователь,ЕстьФото", ложь, ложь);
	
	мен = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьМенеджерЗаписи();
	мен.ФизЛицо = ФизЛицо;
	мен.Прочитать();
	Если мен.Выбран() Тогда
		Рез.ЕстьПользователь = не мен.Пользователь.Пустая();
		Рез.ЕстьФото = мен.Фото.Получить() <> Неопределено;
	КонецЕсли;
	
	возврат рез;
КонецФункции

&НаСервере
Процедура УстановитьШиринуИЦвет()
	об = РеквизитФормыВЗначение("Объект");
	Белый = Новый Цвет(255,255,255);
	
	Если об.Ширина = 0 Тогда
		об.Ширина = 40;
	КонецЕсли;
	
	Если (не об.Родитель.Пустая()) и (об.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция ИЛИ об.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор или об.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник
		или об.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел) Тогда
		
		Если об.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция ИЛИ об.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор или об.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник тогда
			об.Ширина = об.Родитель.Ширина;
		КонецЕсли;
		
		ЦвРод = об.Родитель.ЦветФона.Получить();
		Если ЦвРод = Неопределено Тогда
			ЦвРод = Белый;
		КонецЕсли;
		об.ЦветФона = Новый ХранилищеЗначения(ЦвРод);
		ПолеЦвет  = ЦвРод;
		ЦветИзменен = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если об.ЦветФона.Получить() = Неопределено Тогда
		об.ЦветФона = Новый ХранилищеЗначения(Белый);
		ПолеЦвет  = Белый;
		ЦветИзменен = Истина;
		Модифицированность = Истина;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОформление(Команда)
	
	парам = Новый Структура("Родитель", Объект.Ссылка);
	ОпОп = Новый ОписаниеОповещения("ПрименитьОформлениеОбработчик", ЭтаФорма);
	ОткрытьФорму("Справочник.ОргСхема.Форма.ФормаОформленияУпр",парам,ЭтаФорма,,,,опОп);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОформлениеОбработчик(Рез,ДопПарам) Экспорт
	Если ТипЗнч(рез) = тип("Структура") Тогда
		Записать(); // записываем т.к. дочерние объекты могут изменить этот и потом мы пересчитываем объект
		ПрименитьОформлениеНаСервере(рез.Родитель, рез.флЦвет, рез.флШрифт, рез.флШирина, рез.флВысота);
		Прочитать();
		Оповестить("ИзменениеОС", Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрименитьОформлениеНаСервере(ЭлРодитель, Цвет, Шрифт, Ширина, Высота)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОргСхема.Ссылка
	|ИЗ
	|	Справочник.ОргСхема КАК ОргСхема
	|ГДЕ
	|	ОргСхема.Ссылка В ИЕРАРХИИ(&Родитель)
	|	И ОргСхема.Ссылка <> &Ссылка
	|	И ОргСхема.Ссылка <> &Родитель";
	Запрос.УстановитьПараметр("Родитель", ЭлРодитель);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОБъект();
		
		Если Ширина Тогда
			об.Ширина = Объект.Ширина;
		КонецЕсли;
		
		Если Высота Тогда
			об.Высота = Объект.Высота;
		КонецЕсли;
		
		Если Шрифт Тогда
			об.Шрифт = Новый ХранилищеЗначения(ПолеШрифт);
		КонецЕсли;
		
		Если Цвет Тогда
			об.ЦветФона = Новый ХранилищеЗначения(ПолеЦвет);
		КонецЕсли;
		
		об.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Объект.Наименование = СтрЗаменить(Объект.НаименованиеДляОргсхемы, Символы.ПС , " ");
	Если Модифицированность Тогда
		Модиф = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСтатистикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//
	фв = ПолучитьФорму("Справочник.ИА_НастройкиРабочегоСтолаСтатистик.ФормаВыбора");
	фв.Служебные = истина;
	
	Если фв.Список.Отбор.Элементы.Количество() > 0 Тогда
		ЭлементыОтбора = фв.Список.Отбор.Элементы;
	Иначе
		ЭлементыОтбора = фв.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Элементы;
	КонецЕсли;
	
	Для каждого стр из ЭлементыОтбора Цикл
		Если ТипЗнч(стр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если строка(стр.ЛевоеЗначение) = "СлужебнаяНастройка" Тогда
				стр.ПравоеЗначение = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	выбЗн = фв.ОткрытьМодально();
	Если ЗначениеЗаполнено(выбЗн) Тогда
		Объект.НастройкаСтатистик = выбЗн;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСтатистикОткрытие(Элемент, СтандартнаяОбработка)
	Если Объект.НастройкаСтатистик.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		
		ф = ПолучитьФорму("Справочник.ИА_НастройкиРабочегоСтолаСтатистик.ФормаОбъекта");
		ф.Объект.СлужебнаяНастройка = Истина;
		ф.ОткрытьМодально();
		
		Если не ф.Объект.Ссылка.Пустая() Тогда
			НастройкаСтатистик = ф.Объект.Ссылка;
			Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТерминалаПриИзменении(Элемент)
	Если Элемент <> Неопределено Тогда
		УстановитьШиринуИЦвет();
	КонецЕсли;
	
	Если Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Организация") Тогда
		Элементы.АдресКартинки.Видимость = Истина;
		Элементы.Организация.Видимость   = Истина;
		Элементы.Родитель.Видимость      = Ложь;
		Элементы.ПорядокВСхеме.Видимость = Ложь;
		//Элементы.ЭтоВложеннаяОргсхема.Видимость = истина;
	ИначеЕсли Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Учредитель") Тогда
		Элементы.ПорядокВСхеме.Видимость = Ложь;
	Иначе
		Элементы.АдресКартинки.Видимость = Ложь;
		Элементы.Организация.Видимость   = Ложь;    
		Элементы.Родитель.Видимость      = истина;
		Элементы.ПорядокВСхеме.Видимость = истина;
		Элементы.ЭтоВложеннаяОргсхема.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.КраткоеНаименование.Видимость = Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент") ИЛИ Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел");
	Элементы.СсылкаНаВложеннуюОргсхему.Видимость = Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция");
КонецПроцедуры

&НаКлиенте
Процедура ПолеШрифтПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.Сотрудники.Добавить().ФизЛицо = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// проанализируем ширину подчиненных элементов
	Если Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел") ИЛИ Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция") ИЛИ Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сектор") Тогда
		МассивСсылок = ПолучитьДочерниеЭлементыСДругойШириной(Объект.Ссылка);
		Если МассивСсылок.Количество() > 0 Тогда
			ТекстВорпоса = "Изменить ширину у подчиненнных элементов оргсхемы?";
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗаписиЗавершение", ЭтотОбъект), ТекстВорпоса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
            Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Права на ДИ
	ПослеЗаписиФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		УстановитьШиринуПодчиненныхНаСервере(Объект.Ссылка);
		
	КонецЕсли;
	
	ПослеЗаписиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиФрагмент()
	
	Попытка // возможно нет прав на ДИ
		Выполнить("ИА_ОбщиеПроцедуры_Технология.ПроверитьПраваПоста(Объект.Ссылка)");
		Выполнить("ИА_ОбщиеПроцедуры_Технология_Сервер.УдалитьЛишниеПраваДИ(Объект.Ссылка)");
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДочерниеЭлементыСДругойШириной(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОргСхема.Ссылка
	|ИЗ
	|	Справочник.ОргСхема КАК ОргСхема
	|ГДЕ
	|	ОргСхема.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И ОргСхема.Ширина <> &Ширина";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Ширина", Ссылка.Ширина);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьШиринуПодчиненныхНаСервере(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОргСхема.Ссылка
	|ИЗ
	|	Справочник.ОргСхема КАК ОргСхема
	|ГДЕ
	|	ОргСхема.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И ОргСхема.Ширина <> &Ширина";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Ширина", Ссылка.Ширина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Спр = Выборка.Ссылка.ПолучитьОбъект();
		Спр.Ширина = Ссылка.Ширина;
		Спр.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		ПодключитьРасширениеРаботыСФайлами();
	#КонецЕсли
	
	Если Объект.Ссылка.Пустая() Тогда
		УстановитьШиринуИЦвет();
		
		//определим тип терминала
		ТипТерминалаПоРодителю();		
	КонецЕсли;
	
	Если Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция") 
		ИЛИ Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сектор")
		ИЛИ Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сотрудник") 
		ИЛИ Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент")
		ИЛИ Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Организация")Тогда
		Элементы.Ширина.Видимость = ложь;
	КонецЕсли;
	
	ТипТерминалаПриИзменении(Неопределено);
	
	Если Объект.ТипТерминала <> ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент") Тогда
		Элементы.ПоднятьВверх.Видимость = ложь;
		Если Объект.ТипТерминала <> ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел") Тогда
			Элементы.КраткоеНаименование.Видимость = ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция") или Объект.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел") тогда
		Элементы.НаименованиеДолжности.Видимость = Истина;
	Иначе
		Элементы.НаименованиеДолжности.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТипТерминалаПоРодителю()
	Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда 
		ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Организация;
	Иначе	
		ТипТерминалаРодителя = Объект.Родитель.ТипТерминала;
		Если ЗначениеЗаполнено(ТипТерминалаРодителя) Тогда
			
			Если ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Организация Тогда
				ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель;				
				
			ИначеЕсли ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Учредитель Тогда
				ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав;
				
			ИначеЕсли ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав Тогда
				ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент;
				
			ИначеЕсли ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Департамент Тогда
				ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел;
				
			ИначеЕсли ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Отдел Тогда
				ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция;
		
			ИначеЕсли ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Секция Тогда
				ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор;				
				
			ИначеЕсли ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Сектор Тогда
				ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник;				
			КонецЕсли;	
		Иначе
			ТипТерминала = Перечисления.ТипТерминалаОргСхемы.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Объект.ТипТерминала = ТипТерминала;	
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	УстановитьШиринуИЦвет();
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	// обновление ОС
	Если Модиф Тогда
		Оповестить("ИзменениеОС", Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	НачатьПомещениеФайла(Новый ОписаниеОповещения("АдресКартинкиНажатиеЗавершение", ЭтотОбъект),, , истина, УникальныйИдентификатор);	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатиеЗавершение(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		АдресКартинки = Адрес;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоРодителюНаСервере()
	Если не Объект.Родитель.Пустая() и Объект.Родитель.Статистики.Количество() > 0 Тогда
		Объект.Статистики.Загрузить(Объект.Родитель.Статистики.Выгрузить());
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоРодителю(Команда)
	ЗаполнитьПоРодителюНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкуНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	Если Объект.НастройкаСтатистик.Пустая() Тогда
		
		НастройкаОбъект = Справочники.ИА_НастройкиРабочегоСтолаСтатистик.СоздатьЭлемент();
		НастройкаОбъект.Наименование       = Объект.Наименование;
		НастройкаОбъект.КоличествоВСтроке  = 4;
		НастройкаОбъект.КоличествоПериодов = 6;
		НастройкаОбъект.ОсновнойПериод     = Перечисления.ИА_ПериодыДетализации.Неделя;
		НастройкаОбъект.СлужебнаяНастройка = истина;
		
	Иначе
		
		НастройкаОбъект = Объект.НастройкаСтатистик.ПолучитьОбъект();
		
	КонецЕсли;
	
	НастройкаОбъект.Статистики.Очистить();
	
	Если НастройкаОбъект.ОсновнойПериодДетализации.Пустая() Тогда
		НастройкаОбъект.ОсновнойПериодДетализации = Перечисления.ИА_ПериодыДетализации.Неделя;
	КонецЕсли;
	
	Для каждого Стр из Объект.Статистики Цикл
		
		НоваяСтрока                        = НастройкаОбъект.Статистики.Добавить();
		НоваяСтрока.ВидСтатистики          = Стр.Статистика;
		НоваяСтрока.ЗаголовокДиаграммы     = Строка(Стр.Статистика);
		НоваяСтрока.НаименованиеДляЛегенды = Строка(Стр.Статистика); 
		НоваяСтрока.ПериодДетализации      = Перечисления.ИА_ПериодыДетализации.Неделя;
		НоваяСтрока.ПоказыватьВИЦО         = Истина;
		
	КонецЦикла;
	
	НастройкаОбъект.Записать();
	
	Объект.НастройкаСтатистик = НастройкаОбъект.Ссылка;
	Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНастройку(Команда)
	
	Если ЗначениеЗаполнено(Объект.НастройкаСтатистик) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНастройкуЗавершение", ЭтаФорма), "Внимание статистики настройки будут очищены!"+Символы.ПС+"Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьНастройкуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНастройкуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЗаписьПоФизЛицу(фл)
	мен = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьМенеджерЗаписи();
	мен.ФизЛицо = фл;
	мен.Прочитать();
	мен.ФизЛицо = фл;
	мен.Записать();
КонецФункции

&НаКлиенте
Процедура ПользовательФото(Команда)
	тд = Элементы.Сотрудники.ТекущиеДанные;
	Если тд=Неопределено или тд.ФизЛицо.Пустая() Тогда
		возврат;
	КонецЕсли;
	
	ПроверитьЗаписьПоФизЛицу(тд.ФизЛицо);
	
	оповещЗакр = Новый ОписаниеОповещения("ЗакрытиеФизЛицПользФото", ЭтаФорма);

	ЗначениеКлюча = Новый Структура("ФизЛицо", тд.ФизЛицо);
    МассивКл = Новый Массив;
    МассивКл.Добавить(ЗначениеКлюча);
	КлючЗаписи =  Новый("РегистрСведенийКлючЗаписи.ИА_ДанныеФизЛиц", МассивКл);
    ОткрытьФорму( "РегистрСведений.ИА_ДанныеФизЛиц.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи),,,,,оповещЗакр);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФизЛицПользФото(п1,п2) Экспорт
	тд = Элементы.Сотрудники.ТекущиеДанные;
	Если тд=Неопределено или тд.ФизЛицо.Пустая() Тогда
		возврат;
	КонецЕсли;
	
	детали = ЕстьФотоПользователь(тд.ФизЛицо);
	ЗаполнитьЗначенияСвойств(тд, детали);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СотрудникиЕстьПользователь" ИЛИ Поле.Имя = "СотрудникиЕстьФото" Тогда
		СтандартнаяОбработка = ложь;
		ПользовательФото(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиФизЛицоПриИзменении(Элемент)
	ЗакрытиеФизЛицПользФото(Неопределено, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПослеУдаления(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИА_ВыборЦвета" И Параметр<>Неопределено ТОгда
		ПолеЦвет = Параметр;
		ЦветИзменен = Истина;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры
